{
  "current_version": "1.8.8",
  "build": 188,

  "app_name": "ventiq_admin",
  "changelogs": [
    {
      "version": "1.8.8",
      "date": "2026-01-30",
      "title": "🤖 Analista IA de Ventas (Beta) y mejora en las promos de productos",
      "changes": [
        {
          "type": "feature",
          "title": "Tu nuevo copiloto para vender mejor",
          "description": "Haz preguntas en lenguaje natural y recibe respuestas claras con oportunidades de mejora en segundos."
        },
        {
          "type": "improvement",
          "title": "Resultados fáciles de leer",
          "description": "Los insights llegan con tablas y gráficas que puedes revisar al instante con tu equipo."
        },
        {
          "type": "improvement",
          "title": "Disponible en Plan Avanzado (beta)",
          "description": "Lanzamiento en fase beta para afinar el analista contigo y seguir mejorando."
        }
      ]
    },
    {
      "version": "1.8.6",
      "date": "2026-01-28",
      "title": "💱 Importación de Excel con Conversión de Monedas Mejorada",
      "changes": [
        {
          "type": "feature",
          "title": "Soporte para Tasas de Cambio Bidireccionales",
          "description": "El sistema ahora soporta tasas de cambio en ambos formatos: CUP→USD y USD→CUP. Automáticamente invierte la tasa si es necesario para realizar conversiones correctas."
        },
        {
          "type": "improvement",
          "title": "Tasas de Cambio Dinámicas en Diálogo de Importación",
          "description": "El diálogo de selección de moneda ahora carga las tasas reales desde la base de datos en lugar de valores hardcodeados, mostrando la tasa actual vigente."
        },
        {
          "type": "fix",
          "title": "Manejo de Tasas Inversas en Importación",
          "description": "Corregido problema donde las tasas guardadas como USD→CUP (1 USD = 485 CUP) no se invertían correctamente para obtener CUP→USD (1 CUP = 1/485 USD)."
        },
        {
          "type": "fix",
          "title": "Null Safety en Cálculo de Monto Total",
          "description": "Agregadas validaciones null-safe en el cálculo del monto total de recepción para evitar errores cuando precio_unitario o cantidad son nulos."
        }
      ]
    },
    {
      "version": "1.8.5",
      "date": "2026-01-27",
      "title": "✅ Tienda sincronizada en todo el panel",
      "changes": [
        {
          "type": "improvement",
          "title": "La tienda se mantiene igual en todas las pantallas",
          "description": "Si cambias la tienda en el Dashboard o en Promociones, se refleja al instante en el resto del panel."
        },
        {
          "type": "improvement",
          "title": "Cambio de tienda más confiable",
          "description": "Al seleccionar una tienda, los datos se recargan automáticamente para mostrar siempre la información correcta."
        },
        {
          "type": "improvement",
          "title": "Edición de almacenes más simple",
          "description": "Ahora puedes editar nombre, dirección y tipo desde una sola pantalla, con la tienda siempre visible."
        },
        {
          "type": "improvement",
          "title": "Promociones más ordenadas",
          "description": "El buscador de productos es más cómodo y evitamos repeticiones en la selección."
        }
      ]
    },
    {
      "version": "1.8.4",
      "date": "2026-01-25",
      "title": "🧪 Control de cambio de precio por vendedor (Beta)",
      "changes": [
        {
          "type": "feature",
          "title": "Permiso individual para cambiar precios",
          "description": "Ahora puedes decidir si cada vendedor puede o no modificar el precio al vender. Esta función está en beta (en prueba) para validar el flujo con tu equipo."
        },
        {
          "type": "improvement",
          "title": "Dónde se edita y cómo",
          "description": "Ve a Gestión de TPVs → pestaña Vendedores. En cada tarjeta verás el switch “Cambio de precio”: actívalo para permitirlo o apágalo para bloquearlo. Los cambios se guardan al instante."
        },
        {
          "type": "feature",
          "title": "Historial claro de cambios de precio",
          "description": "Ahora puedes ver un listado con los cambios de precio realizados por vendedores, incluyendo quién lo hizo, en qué TPV y la fecha del cambio."
        },
        {
          "type": "improvement",
          "title": "Cómo ver los cambios de precio",
          "description": "Entra a Gestión de TPVs → pestaña Cambios. Ahí puedes filtrar por TPV, vendedor o rango de fechas para encontrar el ajuste que buscas."
        }
      ]
    },
    {
      "version": "1.8.3",
      "date": "2026-01-22",
      "title": "🔧 Correcciones menores.",
      "changes": [
         {
          "type": "improvement",
          "title": "Gestión de Ventas",
          "description": "Mejoras en gestión ventas por proveedor."
        },
        {
          "type": "fix",
          "title": "🛍️ Corrección en recepciones",
          "description": "Corrección en el buscador de productos en las recepciones de productos."
        }
      ]
    },
    {
      "version": "1.8.2",
      "date": "2026-01-22",
      "title": "🧾 Consignaciones y gestión de proveedores.",
      "changes": [
         {
          "type": "improvement",
          "title": "Gestión de proveedores",
          "description": "Gestión de proveedores de prodcutos y reportes de ventas por proveedor."
        },
        {
          "type": "fix",
          "title": "🛍️ Mejoras en Consignaciones",
          "description": "Consignador ve precio costo en USD y CUP, margen seleccionable, precio de venta final en CUP, equivalente en USD y ganancia en USD."
        }
      ]
    },
    {
      "version": "1.8.1",
      "date": "2026-01-21",
      "title": "🧾 PDF de ventas con costos reales",
      "changes": [
         {
          "type": "improvement",
          "title": "Gestión de proveedores",
          "description": "Gestión de proveedores de prodcutos y reportes de ventas por proveedor."
        },
        {
          "type": "fix",
          "title": "Costo en CUP por factura",
          "description": "Cada orden en el PDF ya muestra el costo real en CUP usando el mismo cálculo del análisis de producto cuando el item no trae costo."
        },
        {
          "type": "improvement",
          "title": "Costos por producto más claros",
          "description": "Se añadió la columna de costo total por producto junto al costo unitario, subtotal y ganancia."
        },
        {
          "type": "improvement",
          "title": "Ganancias con colores",
          "description": "Las ganancias ahora se destacan en verde y las pérdidas en rojo en las tablas y resúmenes del PDF."
        },
        {
          "type": "improvement",
          "title": "Rango de fechas en un solo diálogo",
          "description": "La selección de fechas para el PDF se hace en un único selector de rango, más rápido y cómodo."
        }
      ]
    },
    {
      "version": "1.8.0",
      "date": "2026-01-17",
      "title": "📄 Facturas claras y fechas completas",
      "changes": [
        {
          "type": "feature",
          "title": "Facturas en PDF más completas",
          "description": "Al generar el PDF ves cada producto con su costo, subtotal y ganancia, además del total por orden."
        },
        {
          "type": "improvement",
          "title": "Fechas con hora exacta",
          "description": "Las órdenes muestran fecha y hora completas para que sepas cuándo se creó cada venta."
        },
        {
          "type": "fix",
          "title": "Pagos sin referencias innecesarias",
          "description": "El PDF ya no muestra el número de referencia de pago, solo el medio y el monto."
        },
        {
          "type": "fix",
          "title": "Ingredientes bien listados",
          "description": "Los productos con aditamentos ya no repiten el nombre del producto; verás solo los ingredientes agregados."
        }
      ]},
    {
      "version": "1.7.3",
      "date": "2026-01-14",
      "title": "🎉 Precios Carnaval a un clic",
      "changes": [
        {
          "type": "feature",
          "title": "Nuevo tab \"Precios Carnaval\" en Configuración",
          "description": "Ahora tienes un espacio dedicado para revisar tus precios de Carnaval frente a Inventtia sin salir de Configuración. Todo se carga con la tienda que ya tienes seleccionada."
        },
        {
          "type": "improvement",
          "title": "Edita precios al instante",
          "description": "Ajusta precio_descuento y price directo desde la tabla con un diálogo sencillo: editas, guardas y el listado se actualiza solo."
        },
        {
          "type": "improvement",
          "title": "Tienda fija desde StoreService",
          "description": "Nos encargamos de tomar tu tienda actual automáticamente, así no vuelves a seleccionar nada para ver tus precios."
        },
        {
          "type": "improvement",
          "title": "Tasas USD→CUP personalizadas por tienda",
          "description": "El dashboard, la conversión y la consignación ahora usan tu tasa extraoficial (si está activa) para mostrar valores consistentes en toda la app."
        }
      ]
    },
    {
      "version": "1.7.2",
      "date": "2026-01-11",
      "title": "🔒 Solución de seguridad",
      "changes": [
        {
          "type": "improvement",
          "title": "Filtrado de tienda en selección de almacenes para transferencia para usuarios multitiendas",
          "description": "Los usuarios con mas de una tienda al seleccionar una se filtran los alamacenes de esa tienda correspondiente y ya no se muestran todos."
        }
      ]
    },
    {
      "version": "1.7.0",
      "date": "2026-01-05",
      "title": "🔒 Nuevo rol Auditor (Solo lectura)",
      "changes": [
        {
          "type": "feature",
          "title": "Nuevo rol Auditor",
          "description": "Agregamos el rol Auditor para revisiones: permite consultar la información sin modificarla."
        },
        {
          "type": "improvement",
          "title": "Acceso de solo lectura en secciones clave",
          "description": "El rol Auditor ahora puede ver datos en módulos como consignaciones, clientes y configuración de impresoras, pero sin crear, editar, eliminar o confirmar acciones."
        },
        {
          "type": "improvement",
          "title": "Permisos más consistentes por tienda",
          "description": "Mejoramos el control de permisos para que se mantenga correcto al cambiar de tienda."
        }
      ]
    },
    {
      "version": "1.6.7",
      "date": "2026-01-03",
      "title": "🔧 Correcciones de Estabilidad en Catálogo y Promociones",
      "changes": [
        {
          "type": "fix",
          "title": "Error de Activación en Catálogo",
          "description": "Corregido error que impedía activar el catálogo debido a una referencia incorrecta de columna en la base de datos."
        },
        {
          "type": "fix",
          "title": "Error de Tipos en Promociones",
          "description": "Solucionado error de tipo (TypeError) al crear promociones que afectaba la identificación de la tienda."
        }
      ]
    },
    {
      "version": "1.6.6",
      "date": "2026-01-02",
      "title": "💾 Guardado de Precios de Venta en Detalles de Envío",
      "changes": [
        {
          "type": "feature",
          "title": "Guardado de precio_venta_cup en Detalles del Envío",
          "description": "El precio de venta (precio_venta_cup) configurado por el consignatario ahora se guarda automáticamente en app_dat_consignacion_envio_producto cuando se acepta el envío"
        },
        {
          "type": "improvement",
          "title": "Flujo Claro de Aceptación de Envíos",
          "description": "Simplificado el flujo: consignatario verifica detalles en pantalla de detalles, luego acepta y configura precios en pantalla de confirmación de recepción"
        }
      ]
    },
    {
      "version": "1.6.5",
      "date": "2025-12-29",
      "title": "💰 Cálculo de Ganancias en Confirmación de Envíos de Consignación",
      "changes": [
        {
          "type": "feature",
          "title": "Columna de Ganancias en Confirmación de Envíos",
          "description": "Nueva columna que calcula automáticamente las ganancias esperadas en USD, CUP y porcentaje basado en el precio de venta configurado por el consignatario"
        },
        {
          "type": "improvement",
          "title": "Eliminación de Sección de Margen %",
          "description": "Removida la sección de cálculo de margen porcentual para simplificar la interfaz y enfocarse en el precio de venta final"
        },
        {
          "type": "improvement",
          "title": "Campo de Precio de Venta Sin Preconfiguración",
          "description": "El campo de precio de venta ahora está vacío sin valor preconfigurado, permitiendo que el consignatario ingrese libremente el precio deseado"
        },
        {
          "type": "improvement",
          "title": "Visualización de Ganancias en Tiempo Real",
          "description": "Las ganancias se actualizan automáticamente conforme el consignatario ingresa el precio de venta, mostrando indicadores visuales de ganancia positiva (verde) o negativa (rojo)"
        },
        {
          "type": "improvement",
          "title": "Desglose de Ganancias en Múltiples Monedas",
          "description": "Las ganancias se muestran en USD, CUP y porcentaje para dar visibilidad completa de la rentabilidad esperada en ambas monedas"
        }
      ]
    },
    {
      "version": "1.6.4",
      "date": "2025-12-26",
      "title": "🔄 Lógica de Estados de Consignación y Búsqueda Eficiente",
      "changes": [
        {
          "type": "feature",
          "title": "Validación de Dependencias en Operaciones de Consignación",
          "description": "Sistema que valida que la operación de extracción esté completada antes de permitir completar la operación de recepción en envíos de consignación"
        },
        {
          "type": "feature",
          "title": "Búsqueda Eficiente en Pantalla de Consignación",
          "description": "Implementado sistema de búsqueda con filtrado en base de datos, búsqueda en tiempo real y paginación para mejorar rendimiento en listados grandes"
        },
        {
          "type": "feature",
          "title": "Filtrado por Estado de Confirmación",
          "description": "Agregados chips de filtro para filtrar contratos de consignación por estado: Pendientes, Confirmados y Cancelados"
        },
        {
          "type": "feature",
          "title": "Paginación con Botón 'Cargar Más'",
          "description": "Sistema de paginación que carga 20 registros inicialmente y permite cargar más mediante botón 'Cargar más' para mejor rendimiento"
        },
        {
          "type": "improvement",
          "title": "Verificación de Actualización Diferenciada por Plataforma",
          "description": "Sistema inteligente que detecta si la aplicación se ejecuta en web o APK y muestra diferentes opciones de actualización según la plataforma"
        },
        {
          "type": "improvement",
          "title": "Actualización Obligatoria en Web con Limpieza de Cache",
          "description": "En web, la actualización es obligatoria y guía al usuario a limpiar el cache del navegador con instrucciones paso a paso (Ctrl+Shift+Delete)"
        },
        {
          "type": "improvement",
          "title": "Actualización Obligatoria en APK",
          "description": "En APK, mantiene el sistema de actualización obligatoria con descarga directa del archivo APK"
        }
      ]
    },
    {
      "version": "1.6.3",
      "date": "2025-12-24",
      "title": "📦 Paginado de Movimientos y Mejoras en Consignación",
      "changes": [
        {
          "type": "feature",
          "title": "Paginado Infinito en Movimientos de Productos",
          "description": "Implementado sistema de paginado con infinite scroll en la pantalla de movimientos de productos. Carga inicial de 20 elementos con carga progresiva al llegar al final de la lista."
        },
        {
          "type": "improvement",
          "title": "Dropdown de Margen en Consignación",
          "description": "Agregado dropdown con opciones de margen (1-15%) al lado del precio costo en CUP en asignar_productos_consignacion_screen. Calcula automáticamente el precio de venta final."
        },
        {
          "type": "improvement",
          "title": "Visualización de Precios en Consignación",
          "description": "Consignador ve precio costo en USD y CUP, margen seleccionable, precio de venta final en CUP, equivalente en USD y ganancia en USD."
        }
      ]
    },
    {
      "version": "1.6.2",
      "date": "2025-12-23",
      "title": "🔧 Correcciones en Interacciones, Extracción y UI",
      "changes": [
        {
          "type": "fix",
          "title": "Manejo de Valores Nulos en Ratings de Productos",
          "description": "Corregido manejo de valores nulos en estadísticas de ratings de productos para evitar errores de tipo cast. Ahora todos los campos numéricos se convierten a 0 si son nulos."
        },
        {
          "type": "fix",
          "title": "Optimización de Transferencia de Inventario",
          "description": "Eliminadas llamadas innecesarias a RPC por cada producto en transferencias de inventario para evitar timeouts. Ahora se procesan todos los productos de una sola vez."
        },
        {
          "type": "fix",
          "title": "Overflow en Tarjeta de Módulos del CRM",
          "description": "Corregido desbordamiento visual en tarjetas de módulos del dashboard CRM ajustando padding, tamaños de fuente e iconos. Texto ahora se adapta correctamente sin desbordarse."
        },
        {
          "type": "fix",
          "title": "Overflow en Row de KPI Cards",
          "description": "Envuelto Row de detalles en SingleChildScrollView para permitir scroll horizontal cuando el contenido no cabe en pantallas pequeñas."
        },
        {
          "type": "improvement",
          "title": "Distribución de Estrellas en Ratings de Productos",
          "description": "Extendido RPC get_estadisticas_productos_rating para retornar cantidad de cada rating (1-5 estrellas). Ahora se muestra la distribución visual completa en el resumen de productos."
        },
        {
          "type": "improvement",
          "title": "Navegación desde Card de Ratings de Productos",
          "description": "Card de calificación promedio de productos ahora es clickeable y navega al listado detallado de ratings de productos."
        },
        {
          "type": "improvement",
          "title": "Remoción de Información del Usuario en Ratings",
          "description": "Eliminado campo usuario_email de todas las RPCs de interacciones. Ahora solo se muestran rating, comentario y fecha sin información del usuario."
        },
        {
          "type": "fix",
          "title": "Loading State en Diálogo de Cerrar Sesión",
          "description": "Agregado estado loading al diálogo de cerrar sesión. Ahora muestra spinner y deshabilita botones mientras se procesa el logout, evitando múltiples clics."
        },
        {
          "type": "fix",
          "title": "Cantidades Incorrectas en Extracción de Inventario",
          "description": "Corregido cálculo de stock disponible en diálogo de extracción. Ahora muestra correctamente el stock en la ubicación seleccionada, no el stock total del producto."
        },
        {
          "type": "fix",
          "title": "Campo id_producto Nulo en Extracción",
          "description": "Agregado mapeo de id_producto a id en _addProductToExtraction para asegurar que el producto seleccionado tenga el campo id requerido por la RPC."
        }
      ]
    },
    {
      "version": "1.6.1",
      "date": "2025-12-23",
      "title": "🔧 Correcciones y Estabilidad",
      "changes": [
        {
          "type": "fix",
          "title": "Correcciones en Catálogo y Mejoras Generales",
          "description": "Se han realizado correcciones en el catálogo de productos y mejoras generales de estabilidad y rendimiento."
        }
      ]
    },
    {
      "version": "1.6.0",
      "date": "2025-12-22",
      "title": "🛍️ Catálogo de Productos y Mejoras en Consignaciones",
      "changes": [
        {
          "type": "feature",
          "title": "Gestión Completa de Catálogo de Productos",
          "description": "Nuevo módulo para publicar y gestionar productos en catálogo con validación de requisitos (denominación, precio, imagen y presentación)"
        },
        {
          "type": "feature",
          "title": "Pantalla de Gestión de Catálogo",
          "description": "Nueva pantalla con listado de productos, búsqueda, filtros y toggle para publicar/despublicar productos en catálogo con validaciones automáticas"
        },
        {
          "type": "feature",
          "title": "Edición Inline de Productos en Catálogo",
          "description": "Posibilidad de editar nombre, precio base del sistema e imagen directamente desde el diálogo de detalles del producto"
        },
        {
          "type": "feature",
          "title": "Carga de Imágenes de Productos",
          "description": "Sistema de carga de imágenes a Supabase Storage con URL pública automática y actualización del producto"
        },
        {
          "type": "feature",
          "title": "Validación de Requisitos de Catálogo",
          "description": "Sistema automático que valida que los productos tengan denominación, precio vigente, imagen y presentación antes de publicar en catálogo"
        },
        {
          "type": "feature",
          "title": "Control de Acceso por Plan de Suscripción",
          "description": "Acceso al módulo de catálogo restringido a tiendas con plan Pro o Avanzado activo"
        },
        {
          "type": "feature",
          "title": "Activación de Catálogo por Tienda",
          "description": "Nueva opción en configuración de tienda para activar/desactivar la publicación en catálogo"
        },
        {
          "type": "improvement",
          "title": "Reorden de Tabs en Configuración",
          "description": "Tab de Tienda movido al segundo lugar en la pantalla de Configuración para mejor accesibilidad"
        },
        {
          "type": "improvement",
          "title": "Precio Base del Sistema",
          "description": "Aclaración visual de que el precio editado es el precio base del producto en todo el sistema"
        },
        {
          "type": "improvement",
          "title": "Feedback Visual en Ediciones",
          "description": "Indicadores de carga, mensajes de confirmación y validaciones en tiempo real al editar productos"
        },
        {
          "type": "fix",
          "title": "Corrección en Validación de Precios de Consignación",
          "description": "Corregida validación de precios vigentes en RPC de consignación para verificar fechas correctamente"
        },
        {
          "type": "fix",
          "title": "Corrección en Nombres de Campos de Precio",
          "description": "Alineación correcta de nombres de campos (precio_venta_cup) en todas las consultas y RPCs"
        },
        {
          "type": "improvement",
          "title": "Duplicación Bajo Demanda en Consignaciones",
          "description": "Sistema inteligente que duplica productos solo cuando es necesario en contratos de consignación, reutilizando los que ya existen en la tienda destino"
        },
        {
          "type": "improvement",
          "title": "Verificación Automática de Categorías y Presentaciones",
          "description": "Al duplicar productos en consignación, se verifica y crea automáticamente categorías, subcategorías y presentaciones en la tienda destino"
        }
      ]
    },
    {
      "version": "1.5.2",
      "date": "2025-12-17",
      "title": "🔧 Correcciones Varias e Integración Carnaval",
      "changes": [
        {
          "type": "fix",
          "title": "Corrección en Integración",
          "description": "Corrección en las funcionalidades relacionadas con la integración de Carnaval."
        },
        {
          "type": "fix",
          "title": "Correcciones en Consignaciones",
          "description": "Ajustes y correcciones en el módulo de consignaciones."
        },
        {
          "type": "fix",
          "title": "Correcciones en Dashboard",
          "description": "Mejoras y correcciones visuales en el dashboard principal."
        },
        {
          "type": "fix",
          "title": "Correcciones en Login",
          "description": "Solución de problemas reportados en la pantalla de inicio de sesión."
        },
        {
          "type": "fix",
          "title": "Correcciones en Suscripciones",
          "description": "Ajustes en la gestión y visualización de suscripciones."
        },
        {
          "type": "fix",
          "title": "Correcciones en Admin Drawer",
          "description": "Correcciones en el menú lateral de administración."
        }
      ]
    },
    {
      "version": "1.5.1",
      "date": "2025-12-08",
      "title": "💳 Desglose Mejorado de Métodos de Pago",
      "changes": [
        {
          "type": "feature",
          "title": "Separación de Pagos en Efectivo",
          "description": "Ahora !a partir de las futuras ventas! puedes ver claramente la diferencia entre pagos en efectivo con descuento (Oferta) y pagos en efectivo regulares en todos los reportes de ventas."
        },
        {
          "type": "feature",
          "title": "Totales Separados en Órdenes",
          "description": "Al ver el detalle de órdenes de un vendedor, los totales ahora se muestran separados: Efectivo (Oferta), Efectivo (Regular) y Transferencias, cada uno con su propio color distintivo."
        },
        {
          "type": "feature",
          "title": "Totales en Órdenes Pendientes",
          "description": "Las órdenes pendientes también muestran los totales separados por tipo de pago, ayudándote a tener un mejor control del dinero que esperas recibir."
        },
        {
          "type": "improvement",
          "title": "Identificación Visual Mejorada",
          "description": "Cada tipo de pago tiene su propio color e ícono: verde oscuro con etiqueta de oferta para efectivo con descuento, verde claro para efectivo regular, y azul para transferencias."
        },
        {
          "type": "improvement",
          "title": "Reportes Más Precisos",
          "description": "Con esta separación puedes analizar mejor qué porcentaje de tus ventas se hacen con descuento y tomar mejores decisiones comerciales."
        }
      ]
    },
    {
      "version": "1.5.0",
      "date": "2025-12-05",
      "title": "💰 Sistema Completo de Liquidaciones de Consignación",
      "changes": [
        {
          "type": "feature",
          "title": "Módulo de Liquidaciones con Conversión CUP/USD",
          "description": "Nuevo sistema completo para gestionar liquidaciones de contratos de consignación con conversión automática de CUP a USD usando tasas de cambio en tiempo real"
        },
        {
          "type": "feature",
          "title": "Pantalla de Gestión de Liquidaciones",
          "description": "Nueva pantalla completa con listado de liquidaciones, filtros por estado (pendiente/confirmada/rechazada), totales y acciones según rol de usuario"
        },
        {
          "type": "feature",
          "title": "Estadísticas de Liquidaciones en Detalle de Contrato",
          "description": "Visualización de monto total del contrato, total liquidado y saldo pendiente en USD y CUP directamente en el detalle del contrato"
        },
        {
          "type": "feature",
          "title": "Cálculo Automático de Monto Total de Contrato",
          "description": "El sistema calcula y actualiza automáticamente el monto_total del contrato al confirmar productos enviados en consignación"
        },
        {
          "type": "improvement",
          "title": "Visualización Dual de Monedas",
          "description": "Todos los montos se muestran tanto en USD como en CUP con diseño visual diferenciado y colores distintivos"
        }
      ]
    },
    {
      "version": "1.4.1",
      "date": "2025-11-30",
      "title": "🔧 Corrección de problemas visuales",
      "changes": [
        {
          "type": "fix",
          "title": "Correcciones menores en detalle de producto e importación de inventario desde excel",
          "description": "Correcta visualización del detalle de los precios en el detalle de producto y manejo de importación desde excel"
        }
      ]
    },
    {
      "version": "1.4.0",
      "date": "2025-11-27",
      "title": "🖨️ Impresión WiFi y Gestión de Consignaciones",
      "changes": [
        {
          "type": "feature",
          "title": "Módulo Completo de Consignaciones",
          "description": "Nuevo sistema para gestionar ventas por consignación con seguimiento de productos entregados, vendidos y devoluciones"
        },
        {
          "type": "feature",
          "title": "Impresión WiFi de Tickets",
          "description": "Soporte para impresoras térmicas WiFi (ESC/POS) con configuración de IP y puerto, permitiendo imprimir tickets sin cables"
        },
        {
          "type": "feature",
          "title": "Impresión de Operaciones de Inventario",
          "description": "Imprime comprobantes detallados de todas las operaciones de inventario (entradas, salidas, ajustes) por WiFi o Bluetooth"
        },
        {
          "type": "feature",
          "title": "Gestión de Impresoras WiFi",
          "description": "Módulo para guardar, editar y seleccionar impresoras WiFi configuradas con validación de conexión en tiempo real"
        },
        {
          "type": "improvement",
          "title": "Manejo Robusto de Errores de Impresión",
          "description": "Validaciones y mensajes claros cuando falla la conexión o impresión, con reintentos automáticos y advertencias específicas"
        },
        {
          "type": "fix",
          "title": "Corrección de SnackBar Persistente",
          "description": "Solucionado error de contexto nulo en notificaciones de suscripción que causaba crashes al presionar acciones"
        }
      ]
    },
    {
      "version": "1.3.2",
      "date": "2025-11-25",
      "title": "💼 Precio Costo Promedio Ponderado y TPVs",
      "changes": [
        {
          "type": "feature",
          "title": "Gestión de Precio Costo Promedio Ponderado",
          "description": "Sistema automático de cálculo de costo promedio ponderado para productos, actualizándose con cada entrada de inventario"
        },
        {
          "type": "feature",
          "title": "Gestión Completa de TPVs",
          "description": "Módulo para administrar Terminales Punto de Venta con configuración, estado, asignación a tiendas y seguimiento de operaciones"
        },
        {
          "type": "feature",
          "title": "Configuración Flexible de Datos de Cliente en Ventas",
          "description": "Nueva opción de configuración para no solicitar datos de cliente en transacciones de venta, permitiendo ventas anónimas"
        },
        {
          "type": "feature",
          "title": "Inicializar Inventario Faltante de productos en Catálogo",
          "description": "NUeva opción para inicializar en 0 el inventario de productos que no han tenido entradas en el sistema."
        },
        {
          "type": "improvement",
          "title": "Cambios Menores de Usabilidad",
          "description": "Optimizaciones generales en navegación, validaciones mejoradas y mensajes de error más claros"
        }
      ]
    },
    {
      "version": "1.3.1",
      "date": "2025-11-13",
      "title": "🍽️ Configuración de Venta de Productos Sin Disponibilidad",
      "changes": [
        {
          "type": "feature",
          "title": "Control de Venta Sin Verificación de Disponibilidad",
          "description": "Nueva configuración global que permite a las tiendas vender productos sin verificar si hay ingredientes o cantidad suficientes disponibles"
        },
        {
          "type": "feature",
          "title": "Diálogo de Advertencia Inteligente",
          "description": "Sistema de advertencia detallado que informa sobre los riesgos de activar la venta sin verificación de disponibilidad, con recomendaciones de seguridad"
        },
        {
          "type": "feature",
          "title": "Switch de Control en Configuración Global",
          "description": "Nuevo switch en el tab Global de Configuración para gestionar si los vendedores deben verificar disponibilidad antes de vender productos"
        },
        {
          "type": "improvement",
          "title": "Flexibilidad Operativa por Tienda",
          "description": "Cada tienda puede decidir independientemente su política de venta según sus necesidades operativas y nivel de confianza en el control manual"
        },
        {
          "type": "improvement",
          "title": "Mensajes Informativos Dinámicos",
          "description": "Subtítulos y notificaciones que explican claramente el comportamiento cuando la verificación está activada o desactivada"
        },
        {
          "type": "improvement",
          "title": "Integración con Seller App",
          "description": "La configuración se sincroniza automáticamente con la aplicación de vendedores para aplicar la política de venta inmediatamente"
        }
      ]
    },
    {
      "version": "1.3.0",
      "date": "2025-11-10",
      "title": "🎉 ¡Bienvenido a Inventtia® - Marca Registrada!",
      "changes": [
        {
          "type": "feature",
          "title": "Marca Registrada Inventtia®",
          "description": "¡Ahora somos Inventtia®! Nuestra marca está oficialmente registrada, garantizando calidad, innovación y compromiso con la gestión empresarial"
        },
        {
          "type": "feature",
          "title": "Gestión Completa de Suscripciones",
          "description": "Nuevo módulo para administrar suscripciones de tiendas: visualiza estado, fechas de vencimiento y gestiona renovaciones desde el panel de administración"
        },
        {
          "type": "feature",
          "title": "1 Mes de Prueba Automático",
          "description": "Al registrar una nueva tienda, el sistema automáticamente asigna 1 mes de prueba con acceso completo a todas las funcionalidades premium de Inventtia®"
        },
        {
          "type": "feature",
          "title": "Monitoreo de Estado de Suscripciones",
          "description": "Visualiza el estado de todas las tiendas: activas, próximas a vencer, vencidas o en período de prueba con indicadores visuales de colores"
        },
        {
          "type": "feature",
          "title": "Alertas de Vencimiento Inteligentes",
          "description": "Sistema de notificaciones automáticas que alerta cuando una suscripción está próxima a vencer para gestionar renovaciones a tiempo"
        },
        {
          "type": "improvement",
          "title": "Dashboard de Suscripciones",
          "description": "Nueva sección en el dashboard mostrando métricas de suscripciones: total activas, próximas a vencer, vencidas y en período de prueba"
        },
        {
          "type": "improvement",
          "title": "Filtros y Búsqueda de Suscripciones",
          "description": "Herramientas avanzadas para filtrar tiendas por estado de suscripción, fecha de vencimiento y buscar por nombre de tienda"
        },
        {
          "type": "improvement",
          "title": "Historial de Renovaciones",
          "description": "Registro completo del historial de renovaciones de cada tienda con fechas, duraciones y estados anteriores"
        }
      ]
    },
    {
      "version": "1.2.1",
      "date": "2025-11-06",
      "title": "⚙️ Configuración de Control de Inventario en Turnos",
      "changes": [
        {
          "type": "feature",
          "title": "Control de Inventario Configurable",
          "description": "Nueva configuración global que permite activar o desactivar el control de inventario al abrir y cerrar turnos para los vendedores"
        },
        {
          "type": "feature",
          "title": "Switch de Control en Configuración Global",
          "description": "Nuevo switch en el tab Global de Configuración para gestionar si los vendedores deben hacer conteo de inventario en sus turnos"
        },
        {
          "type": "improvement",
          "title": "Flexibilidad por Tienda",
          "description": "Cada tienda puede decidir independientemente si requiere control de inventario en turnos según sus necesidades operativas"
        },
        {
          "type": "improvement",
          "title": "Mensajes Informativos",
          "description": "Subtítulos dinámicos que explican claramente el comportamiento cuando el control está activado o desactivado"
        },
        {
          "type": "improvement",
          "title": "Persistencia en Base de Datos",
          "description": "La configuración se guarda automáticamente en la base de datos y se aplica inmediatamente para todos los vendedores de la tienda"
        }
      ]
    },
    {
      "version": "1.2.0",
      "date": "2025-11-05",
      "title": "🔔 Sistema de Notificaciones en Tiempo Real",
      "changes": [
        {
          "type": "feature",
          "title": "Notificaciones Instantáneas",
          "description": "Recibe alertas importantes al instante sobre inventario, ventas y operaciones del negocio"
        },
        {
          "type": "feature",
          "title": "Centro de Notificaciones",
          "description": "Accede a todas tus notificaciones desde el ícono de campana en la barra superior"
        },
        {
          "type": "feature",
          "title": "Alertas con Sonido",
          "description": "Las notificaciones importantes llegan con sonido y vibración para que no te pierdas nada"
        },
        {
          "type": "feature",
          "title": "Historial Completo",
          "description": "Consulta todas tus notificaciones anteriores y marca las importantes como leídas"
        },
        {
          "type": "improvement",
          "title": "Contador Visual",
          "description": "Badge rojo muestra cuántas notificaciones nuevas tienes sin leer"
        }
      ]
    },
    {
      "version": "1.1.2",
      "date": "2025-10-26",
      "title": "🔧 Corrección de Productos Duplicados",
      "changes": [
        {
          "type": "fix",
          "title": "Productos Duplicados en Órdenes",
          "description": "Eliminados productos duplicados en el detalle de órdenes del módulo de Ventas"
        }
      ]
    },
    {
      "version": "1.1.1",
      "date": "2025-10-25",
      "title": "🔧 Correcciones de Validación y Selección de Fechas",
      "changes": [
        {
          "type": "fix",
          "title": "Validación de Roles sin UUID",
          "description": "Corregida validación en edición de trabajadores para permitir guardar sin roles cuando no tienen cuenta de usuario (UUID)"
        },
        {
          "type": "fix",
          "title": "Selector de Fechas en RR.HH.",
          "description": "Solucionado problema de pantalla en blanco al seleccionar fechas en el módulo de Recursos Humanos"
        },
        {
          "type": "fix",
          "title": "Zona Horaria de La Habana en Vista y PDF",
          "description": "Corregida conversión de fechas y horas UTC a zona horaria de (UTC-4) en la vista de turnos, trabajadores y exportación PDF del módulo de Recursos Humanos"
        }
      ]
    },
    {
      "version": "1.1.0",
      "date": "2025-10-25",
      "title": "💰 Módulo de Recursos Humanos y Desglose de Salarios",
      "changes": [
        {
          "type": "feature",
          "title": "Tab de Recursos Humanos",
          "description": "Nuevo módulo completo para gestión de salarios y horas trabajadas con filtros de período personalizable"
        },
        {
          "type": "feature",
          "title": "Desglose de Salarios por Trabajador",
          "description": "Visualización detallada de horas trabajadas, salario por hora y salario total por cada trabajador en el período seleccionado"
        },
        {
          "type": "feature",
          "title": "Desglose por Turnos",
          "description": "Vista expandible de cada turno mostrando todos los trabajadores con sus horarios de entrada/salida y salarios calculados"
        },
        {
          "type": "feature",
          "title": "Exportación de Reportes de Salarios a PDF",
          "description": "Botón flotante para exportar desglose completo de salarios en PDF con resumen general, detalle por trabajador y desglose por turnos"
        },
        {
          "type": "feature",
          "title": "Campo de Salario por Hora",
          "description": "Nuevo campo en la creación/edición de trabajadores para especificar el salario por hora de cada empleado"
        },
        {
          "type": "feature",
          "title": "Visualización de Salarios en Listado",
          "description": "Indicador visual del salario por hora en las tarjetas de trabajadores del módulo Personal"
        },
        {
          "type": "improvement",
          "title": "Cálculo Automático de Salarios",
          "description": "Sistema automático que calcula el salario total multiplicando horas trabajadas por salario/hora configurado"
        },
        {
          "type": "improvement",
          "title": "Filtros de Fecha Mejorados",
          "description": "Filtros de fecha ajustados para incluir todo el día desde 00:00:00 hasta 23:59:59 en consultas de turnos"
        },
        {
          "type": "improvement",
          "title": "Resumen Estadístico de RR.HH.",
          "description": "Tarjeta de resumen con total de turnos, trabajadores, horas trabajadas y salarios totales del período"
        }
      ]
    },
    {
      "version": "1.0.0",
      "date": "2025-10-21",
      "title": "🎉 Lanzamiento Inicial de VentIQ Admin",
      "changes": [
        {
          "type": "feature",
          "title": "Panel de Administración Completo",
          "description": "Sistema completo de administración empresarial con dashboard, gestión de productos, inventario y reportes avanzados"
        },
        {
          "type": "feature",
          "title": "Gestión Avanzada de Productos",
          "description": "Creación, edición y gestión completa de productos con ingredientes, presentaciones, variantes y multimedia"
        },
        {
          "type": "feature",
          "title": "Control de Inventario Inteligente",
          "description": "Sistema de inventario con ubicaciones, operaciones de entrada/salida, históricos y reportes detallados"
        },
        {
          "type": "feature",
          "title": "Dashboard Empresarial",
          "description": "Métricas en tiempo real de ventas, productos, gastos y análisis de rendimiento del negocio"
        },
        {
          "type": "feature",
          "title": "Sistema de Permisos y Roles",
          "description": "Control granular de acceso basado en roles (Gerente, Supervisor, Empleado) con navegación protegida"
        },
        {
          "type": "feature",
          "title": "Exportación de Reportes",
          "description": "Exportación de inventarios y reportes en formatos Excel y PDF con filtros de fecha personalizables"
        },
        {
          "type": "feature",
          "title": "Gestión de Almacenes",
          "description": "Control completo de múltiples almacenes con ubicaciones específicas y seguimiento de stock por ubicación"
        },
        {
          "type": "feature",
          "title": "Sección 'Es Ingrediente'",
          "description": "Visualización de productos que utilizan un ingrediente específico con navegación directa al detalle"
        }
      ]
    }
  ]
}