<!DOCTYPE html>
<html lang="es">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Pol&iacute;tica de Privacidad - Inventtia Marketplace</title>
    <style>
        * { margin: 0; padding: 0; box-sizing: border-box; }
        body {
            font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Roboto, Oxygen, Ubuntu, sans-serif;
            line-height: 1.7;
            color: #2d3748;
            background: #f7fafc;
        }
        .container {
            max-width: 800px;
            margin: 0 auto;
            padding: 40px 24px;
        }
        header {
            text-align: center;
            margin-bottom: 48px;
            padding-bottom: 32px;
            border-bottom: 2px solid #e2e8f0;
        }
        header h1 {
            font-size: 28px;
            color: #1a202c;
            margin-bottom: 8px;
        }
        header p {
            color: #718096;
            font-size: 14px;
        }
        h2 {
            font-size: 20px;
            color: #1a202c;
            margin: 36px 0 16px;
            padding-bottom: 8px;
            border-bottom: 1px solid #e2e8f0;
        }
        h3 {
            font-size: 16px;
            color: #2d3748;
            margin: 24px 0 12px;
        }
        p {
            margin-bottom: 12px;
            color: #4a5568;
        }
        ul {
            margin: 8px 0 16px 24px;
            color: #4a5568;
        }
        li { margin-bottom: 6px; }
        table {
            width: 100%;
            border-collapse: collapse;
            margin: 16px 0;
            font-size: 14px;
        }
        th, td {
            text-align: left;
            padding: 10px 14px;
            border: 1px solid #e2e8f0;
        }
        th {
            background: #edf2f7;
            color: #2d3748;
            font-weight: 600;
        }
        td { color: #4a5568; }
        .highlight {
            background: #ebf8ff;
            border-left: 4px solid #3182ce;
            padding: 16px;
            margin: 16px 0;
            border-radius: 0 8px 8px 0;
        }
        .highlight p { margin-bottom: 0; color: #2c5282; }
        footer {
            text-align: center;
            margin-top: 48px;
            padding-top: 24px;
            border-top: 2px solid #e2e8f0;
            color: #a0aec0;
            font-size: 13px;
        }
        a { color: #3182ce; text-decoration: none; }
        a:hover { text-decoration: underline; }
        @media (max-width: 600px) {
            .container { padding: 24px 16px; }
            header h1 { font-size: 22px; }
            h2 { font-size: 18px; }
            table { font-size: 13px; }
            th, td { padding: 8px 10px; }
        }
    </style>
</head>
<body>
    <div class="container">
        <header>
            <h1>Pol&iacute;tica de Privacidad</h1>
            <p><strong>Inventtia Marketplace LTS</strong></p>
            <p>&Uacute;ltima actualizaci&oacute;n: 18 de febrero de 2025</p>
        </header>

        <h2>1. Introducci&oacute;n</h2>
        <p>Bienvenido a <strong>Inventtia Marketplace LTS</strong> (en adelante, &ldquo;la Aplicaci&oacute;n&rdquo;, &ldquo;nosotros&rdquo; o &ldquo;nuestro&rdquo;). Nos comprometemos a proteger la privacidad de nuestros usuarios. Esta Pol&iacute;tica de Privacidad describe c&oacute;mo recopilamos, utilizamos, almacenamos y protegemos su informaci&oacute;n personal cuando utiliza nuestra aplicaci&oacute;n m&oacute;vil.</p>
        <p>Al utilizar la Aplicaci&oacute;n, usted acepta las pr&aacute;cticas descritas en esta pol&iacute;tica. Si no est&aacute; de acuerdo, le pedimos que no utilice la Aplicaci&oacute;n.</p>

        <h2>2. Informaci&oacute;n que Recopilamos</h2>

        <h3>2.1 Informaci&oacute;n de la Cuenta</h3>
        <p>Cuando se registra en la Aplicaci&oacute;n, recopilamos:</p>
        <ul>
            <li>Nombre(s) y apellido(s)</li>
            <li>Direcci&oacute;n de correo electr&oacute;nico</li>
            <li>N&uacute;mero de tel&eacute;fono</li>
            <li>Contrase&ntilde;a (almacenada de forma cifrada; nunca tenemos acceso a su contrase&ntilde;a en texto plano)</li>
        </ul>

        <h3>2.2 Datos de Ubicaci&oacute;n</h3>
        <p>Con su consentimiento expl&iacute;cito, recopilamos su ubicaci&oacute;n geogr&aacute;fica precisa (GPS) para:</p>
        <ul>
            <li>Mostrar tiendas cercanas en el mapa</li>
            <li>Permitir la selecci&oacute;n de ubicaci&oacute;n de tiendas</li>
            <li>Planificar y calcular rutas de entrega</li>
            <li>Convertir coordenadas en direcciones legibles (geocodificaci&oacute;n inversa)</li>
        </ul>
        <div class="highlight">
            <p>Puede revocar el permiso de ubicaci&oacute;n en cualquier momento desde la configuraci&oacute;n de su dispositivo. La Aplicaci&oacute;n seguir&aacute; funcionando, pero las funciones basadas en ubicaci&oacute;n no estar&aacute;n disponibles.</p>
        </div>

        <h3>2.3 Fotograf&iacute;as e Im&aacute;genes (C&aacute;mara)</h3>
        <p>La Aplicaci&oacute;n solicita acceso a la c&aacute;mara de su dispositivo para:</p>
        <ul>
            <li>Tomar fotograf&iacute;as de productos que desee publicar en el marketplace</li>
            <li>Tomar fotograf&iacute;as de su tienda para personalizar su perfil</li>
            <li>Seleccionar im&aacute;genes existentes de su galer&iacute;a</li>
        </ul>
        <p>Las im&aacute;genes que capture o seleccione se almacenan en nuestros servidores para ser mostradas en el cat&aacute;logo de la Aplicaci&oacute;n.</p>

        <h3>2.4 Informaci&oacute;n de Tiendas y Productos</h3>
        <p>Si usted es vendedor, recopilamos la informaci&oacute;n que proporciona sobre su negocio:</p>
        <ul>
            <li>Nombre de la tienda y descripci&oacute;n</li>
            <li>Direcci&oacute;n f&iacute;sica y ubicaci&oacute;n geogr&aacute;fica</li>
            <li>Tel&eacute;fono de contacto de la tienda</li>
            <li>Horarios de apertura y cierre</li>
            <li>Informaci&oacute;n de productos: nombres, descripciones, precios e im&aacute;genes</li>
        </ul>

        <h3>2.5 Rese&ntilde;as y Calificaciones</h3>
        <p>Recopilamos las calificaciones num&eacute;ricas y comentarios opcionales que usted otorga a:</p>
        <ul>
            <li>Tiendas</li>
            <li>Productos</li>
            <li>La Aplicaci&oacute;n en general</li>
        </ul>

        <h3>2.6 Datos de Uso y Actividad</h3>
        <p>Registramos datos b&aacute;sicos de actividad para mejorar el servicio:</p>
        <ul>
            <li>Registros de acceso a la Aplicaci&oacute;n (fecha y frecuencia)</li>
            <li>Identificador an&oacute;nimo para usuarios invitados (no vinculado a datos personales)</li>
        </ul>
        <p>No utilizamos servicios de an&aacute;lisis de terceros como Google Analytics, Firebase Analytics, ni plataformas similares.</p>

        <h3>2.7 Preferencias de Notificaciones</h3>
        <p>Almacenamos su elecci&oacute;n sobre recibir o no notificaciones, as&iacute; como sus suscripciones a notificaciones de tiendas y productos espec&iacute;ficos.</p>

        <h3>2.8 Datos Almacenados Solo en su Dispositivo</h3>
        <p>Cierta informaci&oacute;n se almacena &uacute;nicamente en su dispositivo y <strong>no se env&iacute;a a nuestros servidores</strong>:</p>
        <ul>
            <li>Carrito de compras (productos seleccionados, cantidades y precios)</li>
            <li>Contactos favoritos de WhatsApp y asociaciones de grupos</li>
            <li>Preferencias de tema visual (claro, oscuro o del sistema)</li>
        </ul>

        <h2>3. Permisos del Dispositivo</h2>
        <p>La Aplicaci&oacute;n solicita los siguientes permisos de su dispositivo:</p>
        <table>
            <thead>
                <tr>
                    <th>Permiso</th>
                    <th>Prop&oacute;sito</th>
                </tr>
            </thead>
            <tbody>
                <tr>
                    <td><strong>Internet</strong></td>
                    <td>Comunicaci&oacute;n con nuestros servidores, carga de mapas y c&aacute;lculo de rutas</td>
                </tr>
                <tr>
                    <td><strong>Ubicaci&oacute;n (precisa y aproximada)</strong></td>
                    <td>Mostrar tiendas cercanas, seleccionar ubicaci&oacute;n de tiendas y planificar rutas</td>
                </tr>
                <tr>
                    <td><strong>C&aacute;mara</strong></td>
                    <td>Capturar fotograf&iacute;as de productos y tiendas para publicar en el marketplace</td>
                </tr>
                <tr>
                    <td><strong>Notificaciones</strong></td>
                    <td>Enviar notificaciones sobre pedidos, promociones, alertas de inventario y mensajes del sistema</td>
                </tr>
                <tr>
                    <td><strong>Ejecuci&oacute;n al iniciar</strong></td>
                    <td>Restaurar notificaciones programadas despu&eacute;s de reiniciar el dispositivo</td>
                </tr>
                <tr>
                    <td><strong>Servicio en segundo plano</strong></td>
                    <td>Mantener la entrega de notificaciones en tiempo real mediante conexi&oacute;n WebSocket</td>
                </tr>
                <tr>
                    <td><strong>Estado de red</strong></td>
                    <td>Detectar si el dispositivo tiene conexi&oacute;n a internet</td>
                </tr>
            </tbody>
        </table>

        <h2>4. C&oacute;mo Utilizamos su Informaci&oacute;n</h2>
        <p>Utilizamos la informaci&oacute;n recopilada para:</p>
        <ul>
            <li>Crear y administrar su cuenta de usuario</li>
            <li>Mostrar tiendas y productos en el marketplace</li>
            <li>Facilitar la comunicaci&oacute;n entre compradores y vendedores</li>
            <li>Calcular rutas y distancias para entregas</li>
            <li>Enviar notificaciones relevantes sobre su actividad</li>
            <li>Mejorar la calidad y el rendimiento de la Aplicaci&oacute;n</li>
            <li>Generar cat&aacute;logos compartibles de tiendas</li>
        </ul>

        <h2>5. Servicios de Terceros</h2>
        <p>Compartimos informaci&oacute;n con los siguientes proveedores de servicios de terceros, &uacute;nicamente en la medida necesaria para operar la Aplicaci&oacute;n:</p>
        <table>
            <thead>
                <tr>
                    <th>Servicio</th>
                    <th>Datos Compartidos</th>
                    <th>Prop&oacute;sito</th>
                </tr>
            </thead>
            <tbody>
                <tr>
                    <td><strong>Supabase</strong></td>
                    <td>Datos de cuenta, tiendas, productos, notificaciones, calificaciones, im&aacute;genes</td>
                    <td>Backend: autenticaci&oacute;n, base de datos, almacenamiento de archivos y notificaciones en tiempo real</td>
                </tr>
                <tr>
                    <td><strong>OSRM</strong> (Open Source Routing Machine)</td>
                    <td>Coordenadas geogr&aacute;ficas</td>
                    <td>C&aacute;lculo de rutas y distancias</td>
                </tr>
                <tr>
                    <td><strong>OpenStreetMap / CARTO</strong></td>
                    <td>Coordenadas de la vista del mapa</td>
                    <td>Renderizado de mapas</td>
                </tr>
                <tr>
                    <td><strong>Whapi</strong> (API de WhatsApp)</td>
                    <td>Identificadores de grupos, mensajes e im&aacute;genes</td>
                    <td>Env&iacute;o de mensajes a grupos de WhatsApp asociados a tiendas</td>
                </tr>
                <tr>
                    <td><strong>Geocodificador de la Plataforma</strong> (Android/iOS)</td>
                    <td>Coordenadas geogr&aacute;ficas</td>
                    <td>Conversi&oacute;n de coordenadas a direcciones legibles</td>
                </tr>
            </tbody>
        </table>

        <h2>6. Almacenamiento y Seguridad de los Datos</h2>
        <ul>
            <li>Los datos de su cuenta y contenido se almacenan en servidores de <strong>Supabase</strong>, que utiliza infraestructura segura con cifrado en tr&aacute;nsito (TLS/SSL) y en reposo.</li>
            <li>Las contrase&ntilde;as se almacenan de forma cifrada mediante algoritmos de hash seguros; nunca almacenamos contrase&ntilde;as en texto plano.</li>
            <li>Las im&aacute;genes se almacenan en buckets de almacenamiento seguro con acceso controlado.</li>
            <li>Los datos locales del dispositivo (carrito, preferencias) se almacenan mediante SharedPreferences y no se transmiten a servidores externos.</li>
            <li>Las comunicaciones entre la Aplicaci&oacute;n y nuestros servidores est&aacute;n cifradas mediante HTTPS.</li>
        </ul>

        <h2>7. Retenci&oacute;n de Datos</h2>
        <p>Conservamos su informaci&oacute;n personal mientras su cuenta est&eacute; activa o seg&uacute;n sea necesario para proporcionarle los servicios. Si solicita la eliminaci&oacute;n de su cuenta, procederemos a eliminar sus datos personales en un plazo razonable, salvo que la ley requiera su retenci&oacute;n.</p>

        <h2>8. Sus Derechos</h2>
        <p>Usted tiene derecho a:</p>
        <ul>
            <li><strong>Acceder</strong> a sus datos personales que tenemos almacenados</li>
            <li><strong>Rectificar</strong> informaci&oacute;n incorrecta o incompleta</li>
            <li><strong>Eliminar</strong> su cuenta y datos personales asociados</li>
            <li><strong>Revocar</strong> permisos del dispositivo (c&aacute;mara, ubicaci&oacute;n, notificaciones) en cualquier momento desde la configuraci&oacute;n de su dispositivo</li>
            <li><strong>Retirar</strong> su consentimiento para el procesamiento de datos</li>
        </ul>
        <p>Para ejercer cualquiera de estos derechos, cont&aacute;ctenos a trav&eacute;s de los medios indicados en la secci&oacute;n de Contacto.</p>

        <h2>9. Informaci&oacute;n que NO Recopilamos</h2>
        <p>Para su tranquilidad, confirmamos que <strong>no</strong> recopilamos:</p>
        <ul>
            <li>Identificadores publicitarios</li>
            <li>Lista de contactos de su dispositivo</li>
            <li>Grabaciones de audio o micr&oacute;fono</li>
            <li>Datos biom&eacute;tricos</li>
            <li>Informaci&oacute;n financiera o de pago (no se procesan pagos dentro de la Aplicaci&oacute;n)</li>
            <li>Historial de navegaci&oacute;n web</li>
        </ul>

        <h2>10. Privacidad de Menores</h2>
        <p>La Aplicaci&oacute;n no est&aacute; dirigida a menores de 13 a&ntilde;os. No recopilamos intencionalmente informaci&oacute;n personal de menores de 13 a&ntilde;os. Si descubrimos que hemos recopilado datos de un menor, los eliminaremos de inmediato.</p>

        <h2>11. Cambios en esta Pol&iacute;tica</h2>
        <p>Podemos actualizar esta Pol&iacute;tica de Privacidad ocasionalmente. Le notificaremos sobre cambios significativos a trav&eacute;s de la Aplicaci&oacute;n o por correo electr&oacute;nico. Le recomendamos revisar esta pol&iacute;tica peri&oacute;dicamente.</p>

        <h2>12. Contacto</h2>
        <p>Si tiene preguntas, inquietudes o solicitudes relacionadas con esta Pol&iacute;tica de Privacidad o el tratamiento de sus datos personales, puede contactarnos a trav&eacute;s de:</p>
        <ul>
            <li><strong>Correo electr&oacute;nico:</strong> soporte@inventtia.com</li>
            <li><strong>Aplicaci&oacute;n:</strong> Inventtia Marketplace LTS</li>
        </ul>

        <footer>
            <p>&copy; 2025 Inventtia Marketplace LTS. Todos los derechos reservados.</p>
        </footer>
    </div>
</body>
</html>
